In [14]:
import pandas as pd

In [15]:
astro=pd.DataFrame()
astro["Name"]=["Earth","Moon","Mercury","Jupiter","Io","51 Pegasi b","Tau Boötis b"]

In [16]:
astro

           Name
0         Earth
1          Moon
2       Mercury
3       Jupiter
4            Io
5   51 Pegasi b
6  Tau Boötis b

In [17]:
astro["r_obs(km)"]=[6371.0, 1737.1, 4880.0, 69911.0, 1821.6, 135830.0, 11945.6]
astro["P_obs(day)"]=[1.0, 27.322, 58.646, 0.414, 1.769, 21.9, 3.31]
astro["R_obs(km)"]=[1.496e8, 3.844e5, 5.791e7, 7.786e11, 4.217e5, 7.880e6, 9.343e11]
astro["M_center(Kg)"]=[1.989e30, 5.972e24, 1.989e30, 1.989e30, 1.898e27, 2.208e30, 2.765e30]

In [18]:
astro

           Name  r_obs(km)  P_obs(day)     R_obs(km)  M_center(Kg)
0         Earth     6371.0       1.000  1.496000e+08  1.989000e+30
1          Moon     1737.1      27.322  3.844000e+05  5.972000e+24
2       Mercury     4880.0      58.646  5.791000e+07  1.989000e+30
3       Jupiter    69911.0       0.414  7.786000e+11  1.989000e+30
4            Io     1821.6       1.769  4.217000e+05  1.898000e+27
5   51 Pegasi b   135830.0      21.900  7.880000e+06  2.208000e+30
6  Tau Boötis b    11945.6       3.310  9.343000e+11  2.765000e+30

In [19]:
astro.to_csv("astro.csv")